---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ElementNotEditable
source: html/1c9505e2-32af-0790-bf10-133d3b16cc74.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ElementNotEditable Property

One or more elements are not editable.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementNotEditable { get; }
```